{"catitem":
{"@id": "1.196310",
  "@src": "http://news.yahoo.com/tsa-airport-workers-alleged-terror-ties-arent-threats-145829500--finance.html",
  "@orig_item_date": "Tuesday 16 June 2015 07:01:06 PM UTC",
  "@cat_id": "2",
  "heding": "TSA: Airport workers with alleged terror ties aren't threats",
  "summary": "WASHINGTON (AP) — The Transportation Security Administration says none of the 73 airport workers found to have unspecified ties to terrorism is actually a suspected terrorist or threat to aviation security.", "body": {"bpart": ["WASHINGTON (AP) — None of 73 U.S. airport workers cited by a government watchdog for unspecified ties to terrorism is actually a suspected terrorist or threat to aviation security, a senior Transportation Security Administration official told lawmakers Tuesday.\nThe TSA's deputy assistant administrator, Stacey Fitzmaurice, told members of the House Homeland Security Subcommittee on Transportation Security that an internal review by the agency concluded that none of the workers posed a security threat. The Homeland Security Department's inspector general earlier found that the airport workers had terrorism-related activity codes associated with their names in a government terrorism database, and warned that they could pose a \"potential transportation security threat.'\"\nInspector General John Roth said in a report released earlier this month that TSA doesn't have access to the government's Terrorist Identities Datamart Environment database.", "Fitzmaurice said the TSA is still working with the intelligence community to gain automated access to TIDE, maintained by the National Counterterrorism Center, part of the Office of the Director of National Intelligence. But the agency does review terrorist watch lists when vetting airport workers seeking to work in secure areas, she said.\n\"We do have access to terror watch lists. We are asking for more intelligence information on individuals,\" Fitzmaurice said.\nThe TIDE database includes names of people who are not suspected of being terrorists but may have direct connections to people or organizations that have sparked concerns with the government. Fitzmaurice did not explain why the 73 airport workers were included in the database.\nThe agency has been trying to gain access to the broader terrorism database since last year. Inspector General John Roth told lawmakers that the TSA's request for access to the information still has to be formalized.", "Fitzmaurice told lawmakers that while Roth's office has concluded that airport employee vetting is \"generally effective,\" the TSA is continuing to try to make improvements.\nLawmakers scoffed at the suggestion in the wake of Roth's report and leaks from his office that revealed that auditors were able to sneak to sneak mock explosives, weapons and other prohibited items past security screeners in 67 out of 70 attempts at airport checkpoints.\n\"It's clear today that we can't use that word effective, in my opinion,\" said New York Rep. Kathleen Rice, the top Democrat on the subcommittee.\nChairman John Katko was equally dubious.\n\"We cannot have a bureaucratic morass in charge of airport security. We just cannot,\" the New York Republican said.\n___\nFollow Alicia A. Caldwell on Twitter at www.twitter.com/acaldwellap\nTransportation Security Administration"
]}}}