{"catitem":
{"@id": "1.196289",
  "@src": "http://feeds.reuters.com/~r/reuters/MostRead/~3/PV-SzW7Pve0/story01.htm",
  "@orig_item_date": "Tuesday 16 June 2015 07:01:02 PM UTC",
  "@cat_id": "1",
  "heding": "Putin says Russia beefing up nuclear arsenal, NATO denounces 'sabre-rattling'",
  "summary": "KUBINKA, Russia (Reuters) - President Vladimir Putin said on Tuesday Russia would add more than 40 new intercontinental ballistic missiles (ICBM) to its nuclear arsenal this year, prompting NATO's chief to accuse Moscow of dangerous \"sabre-rattling\".",
  "body":
  {
     "bpart": ["KUBINKA, Russia President Vladimir Putin said on Tuesday Russia would add more than 40 new intercontinental ballistic missiles (ICBM) to its nuclear arsenal this year, prompting NATO's chief to accuse Moscow of dangerous \"sabre-rattling\".\nPutin made his announcement a day after Russian officials denounced a U.S. plan to station tanks and heavy weapons in NATO member states on Russia's border as the most aggressive act by Washington since the Cold War a generation ago.\nTension has flared anew between Russia and Western powers over Moscow's role in the Ukraine crisis, in which pro-Russian separatist forces have seized a large part of the country's east after Russia annexed Crimea from Ukraine in early 2014.\nThe European Union and United States imposed economic sanctions on Russia. But Washington and Moscow are still bound by a 2010 Strategic Arms Reduction Treaty (START) that caps deployed strategic nuclear warheads at 1,550 each and limits the numbers of strategic nuclear missile launchers to 800 by 2018.", "\"More than 40 new intercontinental ballistic missiles able to overcome even the most technically advanced anti-missile defense systems will be added to the make-up of the nuclear arsenal this year,\" Putin, flanked by army officers, said in a speech at an arms fair west of Moscow.\nICBMs have a minimum range of more than 5,500 km (3,400 miles). Putin gave no more details of which missiles were being added to the nuclear arsenal.\nHe has repeatedly urged Russia to maintain its nuclear deterrence to counter what he sees as growing security threats. Moscow also reserves the right to deploy nuclear arms in Crimea.\nSuch comments have helped whip up anti-Western sentiment and rally support behind Putin but have caused disquiet in the West, particularly countries on or near Russia's borders that were under Soviet domination during the Cold War.\nResponding quickly to Putin's remarks, NATO Secretary General Jens Stoltenberg accused Russia of unwarranted \"sabre rattling\" and said this was \"destabilizing and dangerous\".", "At a news briefing in Brussels, Stoltenberg said such rhetoric from Moscow explained the Western alliance's increased preparedness on the part of its forces to defend its member states closest to Russia.\n\"This nuclear sabre-rattling of Russia is unjustified. This is something we are addressing, and itâ\u0080\u0099s also one of the reasons we are now increasing the readiness and preparedness of our forces,\" Stoltenberg said.\n\"We are responding by making sure that NATO also in the future is an alliance which provides deterrence and protection for all allies against any threat.\"\nFEARS OF A NEW ARMS RACE\nLithuanian Defense Minister Juozas Olekas said the planned deployment of U.S. military equipment in eastern Europe, including his country, was a key step to ensure the region's defensibility against growing Russian military capabilities.", "\"We have no other possibilities. If we did nothing, we would be provoking Russia for aggression, like it was in... Ukraine,\" Olekas told Reuters.\nRussian officials warned on Monday that Moscow would retaliate if the United States carried out its plan to store heavy military equipment in eastern Europe, including in the Baltic states that were once in the Soviet Union.\n\"The feeling is that our colleagues from NATO countries are pushing us into an arms race,\" RIA news agency quoted Deputy Defense Minister Anatoly Antonov as saying during \"Army 2015\", a fair at which arms and other military equipment are on show.\nPutin has said Moscow will not be drawn into a new arms race although Russia is modernizing its armed forces. Putin said in his speech that 70 percent of the military equipment in use would by 2020 be the most up-to-date and top-quality.\nPutin had said last year that Russia would add more than 50  intercontinental ballistic missiles in 2015.", "Military expert Ivan Konovalov, head of the Moscow-based Center for Strategic Trends Studies, said Russia is now replacing outdated ICBMs that had been serviced and co-produced by Ukraine, also a former Soviet republic.\nNo such cooperation is taking place anymore and Moscow is putting in place other types of ICBMs it produces on its own.\nThe fair that opened on Tuesday to exhibit more than 330 units of Russian arms and military equipment was the latest example of Moscow showcasing its modernized armed forces.\nBut lavish military spending is burdening Russia's national budget at a time when the economy is sliding towards recession, hammered by low oil prices and Western sanctions.\nThe Kremlin portrays spending on the Russian arms sector as a driver of economic growth, but Putin's critics say it is excessive and comes at the expense of social needs.\n(This story has been refiled to correct Stoltenberg quote, paragraph 12)", "(Additional reporting by Gabriela Baczynska in Moscow and Andrius Sytas in Vilnius, Writing by Gabriela Baczynska, Editing by Timothy Heritage and Mark Heinrich )"]}}}