{"catitem": {"@id": "1.196299", "@src": "http://www.huffingtonpost.com/2015/06/16/twitter-job-search_n_7571260.html?utm_hp_ref=business&ir=Business", "@orig_item_date": "Tuesday 16 June 2015 07:01:04 PM UTC", "@cat_id": "8", "heding": "Twitter Is The Best Job Search Tool You're Not Using -- Here's How You Can", "summary": "Sarah Alvarez got her first job after tweeting about Nutella.\n\nShe was studying abroad in France in 2012 when she saw that Shout PR, a retail and lifestyle marketing firm, had blogged and tweeted about a healthier alternative to the beloved hazelnut spread. Alvarez\nabout the article and thanked the firm for posting it, and she later mentioned that Twitter conversation when she emailed the company about summer internships.\n\nShout had her come for an interview two days after she got back to the U.S. -- and it hired her as an intern.\n\n“Because of the way I reached out, they took a look at my social media profile,” said Alvarez, now an account executive at the communications agency Bite. “I interviewed with the person who had written the blog post, and she was very excited that I’d been engaging with her content.”\n\nIt’s easy to get overwhelmed by the barrage of Twitter noise -- and to favor LinkedIn instead as a professional social media tool. But if you don’t look closely at Twitter, you could be missing out on some crucial job and networking opportunities.\n\nTwitter offers a strong network of people in various fields, and companies and hiring managers are increasingly sharing open positions on their accounts.\n\n“It offers less structure as a job search tool, but more opportunities to connect with people,” said Pamela Skillings, an interview coach and founder of\n, a job coaching program. “You can stumble on an opportunity that you might not otherwise find.”\n\nHere are some tips to get the most out of your Twitter job hunt:\n\n\n\nFirst, think of your Twitter profile as your brand: Include an identifiable photo, so recruiters recognize who you are.\n\nAnd don’t underestimate that bio under your picture. “Your bio is your elevator pitch,” said Alyson Weiss, a social media coach. “It’s your first chance to make an impression before people decide to click on you.”\n\nIn addition, Skillings recommends including your Twitter handle on your resume. “You’re giving people the ability to find you, and it shows a level of transparency.\"\n\n\n\nThe next step is to follow companies, recruiters, publications, job forums and industry leaders. Most brands don’t have a lot of repeat engagement from individual users, which means you can stand out from the crowd if you retweet, favorite and reply to tweets in meaningful ways, experts say.\n\n“Just join the conversation,” said Ashley Stahl, a career coach to millennials. “Find out who your potential boss would be, retweet them and reply to their tweets.”\n\nToo often, however, people don’t think of Twitter as a networking opportunity.\n\n“Twitter wasn’t branded as a professional network like LinkedIn, but that doesn’t mean it has to be only personal,” said Weiss. “We don’t compartmentalize our real lives as professional versus personal.”\n\nOnce you build up a personal conversation with a recruiter or manager, it’s easier to direct message them to ask about connecting outside of Twitter or in person.\n\nSometimes, managers don’t even have an official job posting. Christa Freeland, now the marketing manager at the venture capital firm Powershift, found a job in 2011 at Journyx, a software company, when she started following an employee there who would later be her boss. When she saw he'd tweeted about an open social media marketing role, Freeland immediately applied for the position.\n\n“My boss was very smart about it,” Freeland said of his search for the perfect candidate, adding that the company didn’t actively promote the position anywhere else but on its social media accounts. “It was about finding a marketing person through social media.”\n\n\n\nOne way to sort through Twitter is to create a list for target companies, Weiss suggests.\n\n“It’s overwhelming with so much content, since you turn around for a second and you have 200 missed tweets,” she said. “With a list, you can see job opportunities from specific companies.”\n\nYou can set your list to public or private, and add as many users to it as you like. Clicking on a list gives you a timeline of tweets from just those individuals and companies.\n\n\n\nYou can use Twitter’s built-in search bar for job openings: Type in a location, “hiring” and seniority level (like “entry level” or “director”), and you’ll likely see tweets about open positions in your desired area.\n\nThere are also job search engines specifically for Twitter, like\n, which allows users to add in filters by location, industry and keyword.\n\nHiring managers are more frequently combing Twitter for applicants, particularly in fields where social media acumen might be considered a qualification for a job, like in HR and communications. Other industries -- like nonprofits and academia -- are starting to boost their Twitter presence too, Skillings said.\n\nCharlie Loyd, who creates cloudless satellite imagery at Mapbox, found his job after\nat five mapping companies and including a link to his portfolio. Mapbox responded in three minutes.\n\n\"I was frustrated, and I wanted to get this in front of someone,\" Loyd said. \"And there was no formal submission process for, 'Hey, I'm doing work that you haven't done before.'\"\n\n\nIt’s important to stay up-to-date on recent business developments. If a company you follow recently received a large grant, for example, that might hint at a more aggressive round of hiring.\n\nIf you have an important interview coming up, experts agree it’s important to look up your interviewer and potential managers ahead of time. Their recent tweets could be clues about what topics they’re interested in and what the company culture is like.\n\n“It’s a good small-talk opener,” Stahl said. “You can ask, ‘Did you see the news about subject X?’ You’re opening the interview in a knowledgeable way and putting yourself on equal standing with the hiring manager.”\n\n\n\n\n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "body": {"bpart": ["Sarah Alvarez got her first job after tweeting about Nutella.\nShe was studying abroad in France in 2012 when she saw that Shout PR, a retail and lifestyle marketing firm, had blogged and tweeted about a healthier alternative to the beloved hazelnut spread. Alvarez tweeted about the article and thanked the firm for posting it, and she later mentioned that Twitter conversation when she emailed the company about summer internships.\nShout had her come for an interview two days after she got back to the U.S. -- and it hired her as an intern.\n“Because of the way I reached out, they took a look at my social media profile,” said Alvarez, now an account executive at the communications agency Bite. “I interviewed with the person who had written the blog post, and she was very excited that I’d been engaging with her content.”\nIt’s easy to get overwhelmed by the barrage of Twitter noise -- and to favor LinkedIn instead as a professional social media tool. But if you don’t look closely at Twitter, you could be missing out on some crucial job and networking opportunities.", "Twitter offers a strong network of people in various fields, and companies and hiring managers are increasingly sharing open positions on their accounts.\n“It offers less structure as a job search tool, but more opportunities to connect with people,” said Pamela Skillings, an interview coach and founder of Big Interview , a job coaching program. “You can stumble on an opportunity that you might not otherwise find.”\nHere are some tips to get the most out of your Twitter job hunt:\nSpruce up your profileFirst, think of your Twitter profile as your brand: Include an identifiable photo, so recruiters recognize who you are.\nAnd don’t underestimate that bio under your picture. “Your bio is your elevator pitch,” said Alyson Weiss, a social media coach. “It’s your first chance to make an impression before people decide to click on you.”", "In addition, Skillings recommends including your Twitter handle on your resume. “You’re giving people the ability to find you, and it shows a level of transparency.\"\nStart following and strike up a conversationThe next step is to follow companies, recruiters, publications, job forums and industry leaders. Most brands don’t have a lot of repeat engagement from individual users, which means you can stand out from the crowd if you retweet, favorite and reply to tweets in meaningful ways, experts say.\n“Just join the conversation,” said Ashley Stahl, a career coach to millennials. “Find out who your potential boss would be, retweet them and reply to their tweets.”\nToo often, however, people don’t think of Twitter as a networking opportunity.\n“Twitter wasn’t branded as a professional network like LinkedIn, but that doesn’t mean it has to be only personal,” said Weiss. “We don’t compartmentalize our real lives as professional versus personal.”", "Once you build up a personal conversation with a recruiter or manager, it’s easier to direct message them to ask about connecting outside of Twitter or in person.\nSometimes, managers don’t even have an official job posting. Christa Freeland, now the marketing manager at the venture capital firm Powershift, found a job in 2011 at Journyx, a software company, when she started following an employee there who would later be her boss. When she saw he'd tweeted about an open social media marketing role, Freeland immediately applied for the position.\n“My boss was very smart about it,” Freeland said of his search for the perfect candidate, adding that the company didn’t actively promote the position anywhere else but on its social media accounts. “It was about finding a marketing person through social media.”\nMake lists to narrow in on interesting companies", "One way to sort through Twitter is to create a list for target companies, Weiss suggests.\n“It’s overwhelming with so much content, since you turn around for a second and you have 200 missed tweets,” she said. “With a list, you can see job opportunities from specific companies.”\nYou can set your list to public or private, and add as many users to it as you like. Clicking on a list gives you a timeline of tweets from just those individuals and companies.\nUse search toolsYou can use Twitter’s built-in search bar for job openings: Type in a location, “hiring” and seniority level (like “entry level” or “director”), and you’ll likely see tweets about open positions in your desired area.\nThere are also job search engines specifically for Twitter, like Tweetmyjobs.com , which allows users to add in filters by location, industry and keyword.\nHiring managers are more frequently combing Twitter for applicants, particularly in fields where social media acumen might be considered a qualification for a job, like in HR and communications. Other industries -- like nonprofits and academia -- are starting to boost their Twitter presence too, Skillings said.", "Charlie Loyd, who creates cloudless satellite imagery at Mapbox, found his job after tweeting at five mapping companies and including a link to his portfolio. Mapbox responded in three minutes.\n\"I was frustrated, and I wanted to get this in front of someone,\" Loyd said. \"And there was no formal submission process for, 'Hey, I'm doing work that you haven't done before.'\"\nDo your researchIt’s important to stay up-to-date on recent business developments. If a company you follow recently received a large grant, for example, that might hint at a more aggressive round of hiring.If you have an important interview coming up, experts agree it’s important to look up your interviewer and potential managers ahead of time. Their recent tweets could be clues about what topics they’re interested in and what the company culture is like.", "“It’s a good small-talk opener,” Stahl said. “You can ask, ‘Did you see the news about subject X?’ You’re opening the interview in a knowledgeable way and putting yourself on equal standing with the hiring manager.”\nLet's recap. Here is an easy list of steps you can take to become a pro at using Twitter for job searches:"]}}}