{"catitem": {"@id": "1.196298", "@src": "http://www.huffingtonpost.com/2015/06/16/elizabeth-warren-the-tuit_n_7595806.html?utm_hp_ref=business&ir=Business", "@orig_item_date": "Tuesday 16 June 2015 07:01:04 PM UTC", "@cat_id": "8", "heding": "Elizabeth Warren: The Tuition Is Too Damn High", "summary": "WASHINGTON -- Sen. Elizabeth Warren (D-Mass.) took on the student debt crisis in a wide-ranging interview with The Huffington Post, calling for a federal response to sky-high tuition rates that would allow anyone to attend a public university without taking on debt.\n\n\"Keep in mind that three out of four college students today are in public universities, but they’re paying far more than they did a generation ago,\" Warren said. \"Adjusted for inflation, somebody going to college today to a state university, is paying about 300 percent of what her mom or dad did just 30 years ago.\"\n\nPart of the problem, Warren said, has been the U.S. Department of Education, which has dragged its feet on aiding heavily indebted students, and defended debt companies that allegedly have illegally overcharged students. While both the Department of Justice and the Federal Deposit Insurance Corp. took action against debt servicer Navient after investigators said the company had overcharged active-duty troops, the Education Department recently\nthe company of wrongdoing.\n\n\"The Department of Education needs to get out and do its job on behalf of our students. They don't work for Navient. They don’t work for for-profit colleges. They don’t work for the debt servicers. They work for the American people and they work for the kids that are trying to get an education and are trying to pay off their student loan debts.\"\n\n\n\n\n\n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "body": {"bpart": ["WASHINGTON -- Sen. Elizabeth Warren (D-Mass.) took on the student debt crisis in a wide-ranging interview with The Huffington Post, calling for a federal response to sky-high tuition rates that would allow anyone to attend a public university without taking on debt.\n\"Keep in mind that three out of four college students today are in public universities, but they’re paying far more than they did a generation ago,\" Warren said. \"Adjusted for inflation, somebody going to college today to a state university, is paying about 300 percent of what her mom or dad did just 30 years ago.\"\nPart of the problem, Warren said, has been the U.S. Department of Education, which has dragged its feet on aiding heavily indebted students, and defended debt companies that allegedly have illegally overcharged students. While both the Department of Justice and the Federal Deposit Insurance Corp. took action against debt servicer Navient after investigators said the company had overcharged active-duty troops, the Education Department recently cleared the company of wrongdoing.", "\"The Department of Education needs to get out and do its job on behalf of our students. They don't work for Navient. They don’t work for for-profit colleges. They don’t work for the debt servicers. They work for the American people and they work for the kids that are trying to get an education and are trying to pay off their student loan debts.\"\nListen to the full Warren interview from this week's \"So, That Happened\" podcast below:"]}}}