{"catitem":
{
  "@id": "1.196293",
  "@src": "http://feeds.reuters.com/~r/reuters/topNews/~3/_6qCvDFPO4I/story01.htm",
  "@orig_item_date": "Tuesday 16 June 2015 07:01:03 PM UTC",
  "@cat_id": "4",
  "heding": "Toyota expands Takata U.S. air bag recalls by 1.37 million vehicles",
  "summary": "DETROIT (Reuters) - Toyota Motor Corp will recall almost 1.37 million more vehicles in the United States due to potentially deadly front passenger-side air bags made by Japan's Takata Corp , Toyota said on Tuesday.",
  "body":
  {
    "bpart": ["DETROIT Toyota Motor Corp ( 7203.T ) will recall almost 1.37 million more vehicles in the United States due to potentially deadly front passenger-side air bags made by Japan's Takata Corp ( 7312.T ),  Toyota said on Tuesday.\nThe expansion pushes the total number of Toyota vehicles recalled in the United States because of dangers posed by Takata air bags to more than 2.9 million.\nSome Takata air bags have opened with too much force, sending shrapnel into vehicles. U.S. safety officials, as well as Takata officials, have said that exposure to humidity over time has been a factor in the erroneous air bag deployments.\nSeven deaths linked to Takata air bags have occurred in Honda Motor Co ( 7267.T ) cars, six of them in the United States.\nOn Monday, Honda announced the recall of 1.39 million Accord and Civic cars in the United States with faulty front passenger-side Takata air bags. Those cars had previously been recalled for front driver-side air bags.", "Last month, U.S. safety officials said Takata had doubled its recall of vehicles in the United States to 34 million, and to 53 million globally. Automakers said the number of vehicles affected in the United States is likely half of that total because some have been recalled several times.\nThere have been 24 incidents of incorrect deployments of Takata air bags in Toyota vehicles worldwide, and Toyota has received at least eight reports of injuries said to be linked to air bag ruptures, a Toyota spokeswoman said on Tuesday. Toyota officials have not confirmed those injuries were linked to incorrect deployments, she said.\nShe said that Toyota is not aware of any injuries or fatalities caused by incorrect air bag deployments in the vehicles in the expanded recall it announced on Tuesday.\n(Reporting by Ben Klayman and Bernie Woodall in Detroit; Editing by Peter Galloway)"]}}}