{"catitem": {"@id": "1.196296", "@src": "http://feeds.reuters.com/~r/reuters/topNews/~3/ecAN-8MNFHQ/story01.htm", "@orig_item_date": "Tuesday 16 June 2015 07:01:03 PM UTC", "@cat_id": "4", "heding": "Exclusive: Blackstone, Carlyle in $10 billion-plus bid for NCR", "summary": "(Reuters) - Blackstone Group LP and Carlyle Group LP are making a joint bid for NCR Corp in a leveraged buyout that would be the year's biggest at more than $10 billion, including debt, people familiar with the matter said on Tuesday.", "body": {"bpart": ["n\">Blackstone Group LP ( BX.N ) and Carlyle Group LP ( CG.O ) are making a joint bid for NCR Corp ( NCR.N ) in a leveraged buyout that would be the year's biggest at more than $10 billion, including debt, people familiar with the matter said on Tuesday.\nBlackstone and Carlyle, the world's two largest private equity firms, have joined forces to outbid other buyout firms and acquire Duluth, Georgia-based NCR, which manufactures cash registers and ATMs.\nThe auction for NCR is several weeks away from completion, the people said.\nOther buyout firms vying for NCR include Apollo Global Management LLC ( APO.N ) and Thoma Bravo LLC, the people said. Some of the other private equity firms that are competing could also team up, the people added.\nThere is no certainty that the Blackstone and Carlyle consortium will prevail, or even that NCR will agree to a sale with any party, the people said.\nThe sources asked not to be identified because the sale process is not public. An NCR spokesman did not immediately respond to a request for comment. Spokespeople for the private equity firms either declined to comment or did not respond to requests for comment.", "NCR shares soared by $4.15 or 13.2 percent on the news to $35.52 per share.\nThe company has been exploring options in recent months in light of shareholder pressure. Marcato Capital Management has been calling on NCR since last year to explore strategic alternatives, and now holds a seat on its board of directors. Jana Partners has also reported a 7 percent passive stake.\nIn the first quarter of the year, NCR's revenue declined 3 percent to $1.48 billion compared to a year ago. Free cash flow was $24 million in the first quarter, up from a year ago.\nThe company, which was founded more than a century ago, has been trying to expand into the software space. It recently launched a cloud-based software system for ATM machines called Kalpana that is meant to replace outdated PC software on ATMs and help ATM owners cut costs. It also makes self-checkout machines.", "Retailers, which are some of NCR's biggest customers, have been cutting back on spending, which hurt NCR's revenue in the first quarter, NCR executives said on their last earnings call.\n(Reporting by Greg Roumeliotis and Liana B. Baker in New York; Editing by Lisa Von Ahn and Andrew Hay)"]}}}