{"catitem": {"@id": "1.196292", "@src": "http://feeds.reuters.com/~r/reuters/topNews/~3/N57B-1jjp9Q/story01.htm", "@orig_item_date": "Tuesday 16 June 2015 07:01:03 PM UTC", "@cat_id": "4", "heding": "Victories over Islamic State give Syria Kurds claim to bigger role", "summary": "BEIRUT (Reuters) - With a string of victories over Islamic State, Syria's Kurds are proving themselves an ever more dependable ally in the U.S.-led fight against the jihadists and building influence that will make them a force in Middle Eastern politics.", "body": {"bpart": ["BEIRUT With a string of victories over Islamic State, Syria's Kurds are proving themselves an ever more dependable ally in the U.S.-led fight against the jihadists and building influence that will make them a force in Middle Eastern politics.\nAided by U.S.-led air strikes, the Kurdish-led YPG militia may have dealt Islamic State its worst defeat to date in Syria by seizing the town of Tel Abyad at the Turkish border, cutting a supply route to the jihadists' de facto capital of Raqqa city.\nThe Kurds in northern Syria now control an uninterrupted 400 km stretch of the Turkish frontier, positioning them to help secure an area where the United States says more needs to be done to stop the flow of fighters joining Islamic State.\nThe Pentagon called it a significant advance that could disrupt supplies to Raqqa and the flow of foreign fighters.\nIslamic State forces had appeared to \"crack\" in Tel Abyad and seemed unwilling to confront the Kurdish forces, Colonel Steve Warren, a Pentagon spokesman, said. The YPG-led force advanced on and took Tel Abyad in three days.", "The growing Kurdish sway is of no comfort to Turkey, worried by the risk of separatist sentiment among its own Kurds.\nAnkara sees the widening Kurdish footprint as a possible threat to its border, and the YPG as little more than an offshoot of the PKK group which waged a decades-long insurgency for Kurdish rights in Turkey. President Tayyip Erdogan last week accused the West of helping \"terrorists\".\nBut for now, the United States appears willing to risk upsetting its NATO ally to advance the goal of driving back Islamic State in the Syrian half of its self-declared caliphate.\nWith Raqqa city just 80 km (50 miles) to the south, some analysts wonder whether Washington may now go even further by arming the YPG to help it wage war deeper into Islamic State-held territory and to seal the border.\nThe United States and its allies are bombing Islamic State positions in both Syria and Iraq. The coalition supports the government in Baghdad but is hostile to the government in Damascus, leaving it with few allies on the ground in Syria.", "But even though that means the YPG is so far the only significant partner for the U.S.-led alliance in Syria, it says its request for arms has yet to be answered.\nWith or without new weapons, the YPG's growing role will only strengthen its international standing and its influence over any eventual outcome of the Syrian war.\n\"It gives the Kurds legitimacy and enhances their bargaining position,\" said Henri Barkey, a professor of international relations at Lehigh University in the United States.\nSyria's Kurds are part of a Kurdish nation spread across Syria, Turkey, Iran and Iraq, one of the world's largest ethnic groups without a state.\nWith the onset of the Syrian uprising in 2011, the Syrian Kurds formed their own administration in three separate areas of northern Syria, coordinating with Damascus to expand into areas where the state was retreating. The capture of Tel Abyad means two of those regions are now geographically connected.", "The Syrian Kurds say they do not aspire to found an independent state, but see their model of regional autonomy as one that could form the basis for an eventual settlement to the  war now in its fifth year. The capture of Tel Abyad has created a link between two of the Kurdish autonomous zones, or cantons.\nTurkey's Erdogan has accused Syrian Kurds of displacing Arab and Turkmen residents from some areas they occupy, and some Arab refugees fleeing area have complained of harsh treatment.\nThe YPG denies accusations of ethnic cleansing, and the UK-based Syrian Observatory for Human Rights, which monitors the conflict with a network of sources on the ground, says there is no evidence of systematic YPG abuses.", "BORDER CONTROL\nThe YPG is confident it can secure new areas of the frontier near Tel Abyad. The Kurdish administration in the northeast has already managed to secure large sections of Syria's border since early on in the crisis, said Redur Xelil, a spokesman.\n\"We are committed to protecting these borders because that way we are protecting our existence,\" he said. \"We should be supported with weapons and equipment because the YPG has shown its effectiveness in expelling Daesh more than any other force.\"\nDaesh is an Arabic name for Islamic State, also known in English as ISIS or ISIL.\nThe YPG and the United States joined forces for the first time last year to repel an Islamic State attack on the town of Kobani, or Ayn al-Arab. The cooperation has deepened since then.\nBacked by U.S.-led air strikes, the YPG has driven Islamic State from swathes of the northeastern province of Hasaka - a region important in the fight against Islamic State because it borders areas held by the group in Iraq.", "The Pentagon spokesman said the Tel Abyad advance was \"a great example of the combination of airpower â\u0080\u0093 devastating airpower â\u0080\u0093 along with seasoned, trained and capable ground forces\".\n\"In this case, here in this location, we are seeing ISIL forces crack, not interested in fighting, not interested in facing the force that they face,\" said the spokesman.\nBut the Syrian Kurds complain Western support remains far below the level received by their Iraqi Kurdish cousins.\n\"If there is a decision to put pressure on Raqqa - the center of the Islamic State - this an scenario where I can see the YPG getting more arms from (the United States),\" said Barkey of Lehigh University.\nThough that moment still appeared far off, U.S. officials were likely planning for such a contingency, he said.\n\"To me it is a logical next step.\"\nTENSIONS WITH DAMASCUS\nWhile they have proved effective fighting Islamic State in Kurdish areas, questions remain over how well the YPG would perform in Arab parts of Syria.", "Their attack on Tel Abyad - an ethnically mixed area - was aided by smaller Syrian Arab rebel groups that are part of the more secular-minded opposition to President Bashar al-Assad.\nIn Hasaka province, the Syrian Kurds still share control of two cities with the Syrian government. The sides have mostly left each other to their own devices.\nThere are however signs of strain. The Kurds' alliance with Washington has fueled suspicions in Damascus of a conspiracy to break up Syria, while the Kurds are irritated by what they see as government attempts to recover lost influence in the region.\nTensions between the Syrian government and Kurdish security forces flared in the city of Qamishli overnight. Shots were fired, but no-one was hurt, the Observatory and a Kurdish official said.\n\"The regime will with time get weaker,\" said Nasir Haj Mansour, a Kurdish official in the northeast. \"I do not imagine the regime will be able to strengthen its position.\"", "(Additional reporting by Sylvia Westall in Beirut and Phil Stewart in Washington; Editing by Ralph Boulton )"]}}}