{"catitem": {"@id": "1.196294", "@src": "http://feeds.reuters.com/~r/reuters/topNews/~3/ZII5ZdVYUiU/story01.htm", "@orig_item_date": "Tuesday 16 June 2015 07:01:03 PM UTC", "@cat_id": "4", "heding": "Egypt court hands Mursi death sentence in blow to Muslim Brotherhood", "summary": "CAIRO (Reuters) - An Egyptian court sentenced deposed President Mohamed Mursi to death on Tuesday over a mass jail break during the country's 2011 uprising and issued sweeping punishments against the leadership of Egypt's oldest Islamic group.", "body": {"bpart": ["CAIRO An Egyptian court sentenced deposed President Mohamed Mursi to death on Tuesday over a mass jail break during the country's 2011 uprising and issued sweeping punishments against the leadership of Egypt's oldest Islamic group.\nThe general guide of the Muslim Brotherhood, Mohamed Badie, and four other Brotherhood leaders were also handed the death penalty. More than 90 others, including influential cleric Youssef al-Qaradawi, were sentenced to death in absentia.\nThe Brotherhood described the rulings as \"null and void\" and called for a popular uprising on Friday.\nThe sentences were part of a crackdown launched after an army takeover stripped Mursi of power in 2013 following mass protests against his rule. Hundreds of Islamist have been killed and thousands arrested.\nThe Islamist Mursi became Egypt's first freely elected president after the downfall of longtime leader Hosni Mubarak in 2011.\nJudge Shaaban el-Shami, said the Grand Mufti, Egypt's top religious authority, had said in his opinion that the death sentence was permissible for the defendants who had been referred to him.", "Wearing his blue prison suit, the bespectacled and bearded Mursi listened calmly as Shami read out the verdict in the case relating to the 2011 mass jail break, in which Mursi faced charges of killing, kidnapping and other offences.\nShami had earlier given Mursi a 25-year sentence in a case relating to conspiring with foreign groups.\nMursi appeared unfazed, smiling, and waving to lawyers as other defendants chanted: \"Down, down with military rule,\" after the verdicts, which can be appealed, were read out at the court session in the Police Academy.\nThe rulings mark yet another setback for leaders of the Muslim Brotherhood, and increase the chances of its youth taking up arms against the authorities, breaking what the group says is a long tradition of non-violence.\nBy contrast, Mubarak is slowly being cleared of charges in cases against him. He will face a second retrial over the killing of protesters in 2011 and has been sentenced to three years in jail over a corruption case.", "\"NAIL IN THE COFFIN OF DEMOCRACY\"\nThe court last month convicted Mursi and his fellow defendants of killing and kidnapping policemen, attacking police facilities and breaking out of jail during the 2011 uprising.\nShami said elements of Hamas, Lebanon's Hezbollah, Sinai-based militants and Brotherhood leaders had all participated in storming the jails. He said they had committed \"acts that lead to infringing on the country's independence and the safety of its lands\".\nThe White House said it was deeply troubled by what it called a politically motivated sentence, U.N. Secretary-General Ban Ki-moon said he was deeply concerned and the EU called it a worrying development.\nCairo, however, remains one of Washington's closest allies in a region beset by turmoil in Libya, Syria and Yemen.", "Sisi says the judiciary is independent and has made clear that the death sentences are all preliminary.\nA senior Muslim Brotherhood member condemned the trial.\n\"This verdict is a nail in the coffin of democracy in Egypt,\" Yahya Hamid, a former minister in Mursi's cabinet and head of international relations for the Brotherhood, told a news conference in Istanbul.\nWestern diplomats say Egyptian officials have acknowledged that executing Mursi would risk turning him into a martyr. The Brotherhood has survived decades of repression, maintaining popular support through its charities.\nMursi, Badie and 15 others were given 25 year jail sentences - for conspiring with Palestinian group Hamas, which rules Gaza. They included senior Brotherhood figures Essam el-Erian and Saad el-Katatni.\n\"DIABOLICAL AIMS\"\nThe court sentenced Muslim Brotherhood leaders Khairat el-Shater, Mohamed el-Beltagy and Ahmed Abdelaty to death in the same case. A further 13 were sentenced to death in absentia.", "In reading his verdict, Shami said that the Brotherhood had a history of \"grabbing power with any price\" and had \"legalized the bloodletting of the sons of this country and conspired and collaborated with foreign entities...to achieve their diabolical aims\".\nBadie already has a death sentence against him and Mursi has a 20-year sentence in yet another case.\nMursi has said the court is not legitimate, describing legal proceedings against him as part of a coup led by former army chief Abdel Fattah al-Sisi in 2013. Mursi's court-appointed defense lawyer said he would appeal the verdict.\nSisi, now president, says the Brotherhood poses a grave threat to national security. The group maintains it is committed to peaceful activism.\nSome Egyptians have overlooked the crackdown, which has targeted liberal and secular activists, thankful that Sisi, in toppling Mursi, has delivered a measure of stability after years of turmoil.", "\"I don't care whether the verdict was fair or not. Mursi deserved it,\" said a young man at a cafe in Cairo's Abbasiya district.\nIslamist militant groups have stepped up attacks against soldiers and police since Mursi's fall, killing hundreds.\n(Additional reporting by Ahmed Aboulenein and Mohamed Abdellah in Cairo, Humeyra Pamuk in Istanbul, Julia Edwards in Washington, Michelle Nichols at the United Nations and Foo Yun Chee in Brussels; Writing by Yara Bayoumy; Editing by Michael Georgy and Ralph Boulton )"]}}}