{"catitem": {"@id": "1.196297", "@src": "http://www.huffingtonpost.com/2015/06/16/trade-adjustment-assistance_n_7595150.html?utm_hp_ref=business&ir=Business", "@orig_item_date": "Tuesday 16 June 2015 07:01:04 PM UTC", "@cat_id": "8", "heding": "Dems Say Worker Aid Program 'Is Not In Jeopardy' In Trade Tiff", "summary": "WASHINGTON -- Democrats in the House of Representatives are confident a program that helps laid-off workers won't be a casualty of an ongoing standoff with Republicans over President Barack Obama's trade agenda. The program is due to expire on Sept. 30, however, and it's not clear at present how Congress will prevent that from happening.\n\nOn Friday, Democrats voted overwhelmingly against reauthorizing the federal Trade Adjustment Assistance program because of its connection to a bill that would give the president \"fast track\" authority to proceed with a trade deal known as the\n. Democrats have long supported trade assistance, but\n. Among\n, Democrats oppose the trade deal because they don't think it will benefit American workers.\n\nRep. Sander Levin (D-Mich.), top Democrat on the House committee overseeing the trade bill, pointed to the Obama administration's emphasis on trade assistance when asked if Democrats were willing to let the program die.\n\n\"We're not going to let TAA expire as long as the president is emphatic that it has to continue,\" Levin said Tuesday. \"As long as the president is emphatic that before any trade bill there has to be TAA, TAA is not in jeopardy.\"\n\nCongress has paired worker assistance with free trade bills since 1974, largely as a way to win Democratic support for trade legislation. The TAA program serves about 100,000 Americans annually with education, training and long-term unemployment benefits. Groups of unemployed or soon-to-be unemployed workers become eligible for benefits if they petition the Labor Department and it certifies that international trade contributed significantly to their layoffs.\n\nCome October, absent a reauthorization, people currently receiving assistance will continue to do so, but newly laid-off workers won't be able to sign up, the department said.\n\nRep. Lloyd Doggett (D-Texas), apparently alluding to Obama's call for House Democrats to \"\n\" by not using trade assistance to tank fast track, suggested Congress could keep the program alive without linking it to the trade bill.\n\n\"I'm not sure we've been dealt straight about TAA,\" Doggett said. \"It is a question of whether Republicans are willing to join in appropriating the dollars that are already available there to provide Trade Adjustment Assistance. This notion that our vote lets TAA expire is entirely misplaced.\"\n\nThough the House approved separate fast-track legislation Friday, the measure had been paired with trade assistance, and the chamber has to approve both measures to join the Senate in passing the combined legislation. Democrats voted against the trade benefits on Friday to prevent the measures from reaching the president. It's\nhow the trade bill advances from here, but Republican leaders planned a vote Tuesday afternoon that would allow House Speaker John Boehner (R-Ohio) to bring trade assistance back to the floor for another vote sometime before the end of July.\n\n\n\n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "body": {"bpart": ["WASHINGTON -- Democrats in the House of Representatives are confident a program that helps laid-off workers won't be a casualty of an ongoing standoff with Republicans over President Barack Obama's trade agenda. The program is due to expire on Sept. 30, however, and it's not clear at present how Congress will prevent that from happening.\nOn Friday, Democrats voted overwhelmingly against reauthorizing the federal Trade Adjustment Assistance program because of its connection to a bill that would give the president \"fast track\" authority to proceed with a trade deal known as the Trans-Pacific Partnership . Democrats have long supported trade assistance, but they hate fast track . Among many other reasons , Democrats oppose the trade deal because they don't think it will benefit American workers.\nRep. Sander Levin (D-Mich.), top Democrat on the House committee overseeing the trade bill, pointed to the Obama administration's emphasis on trade assistance when asked if Democrats were willing to let the program die.", "\"We're not going to let TAA expire as long as the president is emphatic that it has to continue,\" Levin said Tuesday. \"As long as the president is emphatic that before any trade bill there has to be TAA, TAA is not in jeopardy.\"\nCongress has paired worker assistance with free trade bills since 1974, largely as a way to win Democratic support for trade legislation. The TAA program serves about 100,000 Americans annually with education, training and long-term unemployment benefits. Groups of unemployed or soon-to-be unemployed workers become eligible for benefits if they petition the Labor Department and it certifies that international trade contributed significantly to their layoffs.\nCome October, absent a reauthorization, people currently receiving assistance will continue to do so, but newly laid-off workers won't be able to sign up, the department said.", "Rep. Lloyd Doggett (D-Texas), apparently alluding to Obama's call for House Democrats to \" play it straight \" by not using trade assistance to tank fast track, suggested Congress could keep the program alive without linking it to the trade bill.\n\"I'm not sure we've been dealt straight about TAA,\" Doggett said. \"It is a question of whether Republicans are willing to join in appropriating the dollars that are already available there to provide Trade Adjustment Assistance. This notion that our vote lets TAA expire is entirely misplaced.\"\nThough the House approved separate fast-track legislation Friday, the measure had been paired with trade assistance, and the chamber has to approve both measures to join the Senate in passing the combined legislation. Democrats voted against the trade benefits on Friday to prevent the measures from reaching the president. It's not clear how the trade bill advances from here, but Republican leaders planned a vote Tuesday afternoon that would allow House Speaker John Boehner (R-Ohio) to bring trade assistance back to the floor for another vote sometime before the end of July.", "HUFFPOST READERS: Have you used or are you currently using Trade Adjustment Assistance benefits? Tell us about it -- email arthur@huffingtonpost.com . Please include your phone number if you're willing to be interviewed."]}}}